{
    "spawnforcer.rule.fixedStart.desc": "Force the spawn cycle to start at a fixed coordinate. Defaults to (0,0,0) and can be changed using startCoords option. Recommend using with allowNear option. The starting position can be further modified by startSpreadX and startSpreadZ options.",
    "spawnforcer.rule.startSpreadX.desc": "Spread the starting x coordinate uniformly between the input x and -x. Defaults to 0. This option only works when fixedStart or fixedInChunk is on.",
    "spawnforcer.rule.startSpreadZ.desc": "Spread the starting z coordinate uniformly between the input z and -z. Defaults to 0. This option only works when fixedStart or fixedInChunk is on.",
    "spawnforcer.rule.allowNear.desc": "Allow mobs to spawn near the player and world spawn point (removes the 24 block restriction). Defaults to false.",
    "spawnforcer.rule.startCoords.desc": "The coordinate the spawn will start at when fixedStart is enabled. The setting must be 3 numbers separated by spaces. If there's any digits, the number will be rounded down. If the command fails to parse, it will default to the coordinate (0,0,0).",
    "spawnforcer.rule.fixedInChunk.desc": "Force the spawn on chunk coordinates x, z defined by chunkStartX and chunkStartZ options. Defaults to false. The fixedStart option takes precedence. Can work with fixedBottomY option.",
    "spawnforcer.rule.chunkStartX.desc": "The x chunk coordinate the spawn will start at when fixedInChunk is enabled. The number is clamped to 0-15 inclusive. Defaults to 0.",
    "spawnforcer.rule.chunkStartZ.desc": "The z chunk coordinate the spawn will start at when fixedInChunk is enabled. The number is clamped to 0-15 inclusive. Defaults to 0.",
    "spawnforcer.rule.fixedBottomY.desc": "Force the spawn cycle to sample the y value starting from the bottomY option instead of the world bottom. Defaults to false. The fixedStart option takes precedence. Can work with fixedInChunk option. If the heightmap is lower than bottomY, it will still sample from between the 2 y levels (i.e. heightmap becomes the \"bottom\" and bottomY becomes the \"top\").",
    "spawnforcer.rule.chunkBottomY.desc": "The y level the spawn cycle will start sampling from when fixedBottomY is enabled. Defaults to 0.",
    "spawnforcer.rule.uniformJump.desc": "Make each x and z jump follow a uniform distribution instead of a triangular distribution. Defaults to false. The grouping will still be relatively closer to the starting point, for a more even spread over all, use spreadJump option. If both are on, spreadJump takes precedence.",
    "spawnforcer.rule.spreadJump.desc": "Make each x and z jump more likely to be near -5 and 5. Defaults to false. If this and uniformJump are on, this one takes precedence.",
    "spawnforcer.rule.jumpSequenceX.desc": "Force each x jump in a pack to follow the given sequence, repeating the last number in the sequence if there's still jumps left. The sequence must be numbers separated by spaces. If there's any digits, the number will be rounded down. If the command fails to parse, it will be ignored. This option overrides the x component of uniformJump and spreadJump options.",
    "spawnforcer.rule.jumpSequenceZ.desc": "Force each z jump in a pack to follow the given sequence, repeating the last number in the sequence if there's still jumps left. The sequence must be numbers separated by spaces. If there's any digits, the number will be rounded down. If the command fails to parse, it will be ignored. This option overrides the z component of uniformJump and spreadJump options."
}
